{
  "Navbar": {
    "Home": "Home",
    "About": "Who am I",
    "Technologies": "Technologies",
    "Projects": "Projects",
    "DownloadCV": "Download CV"
  },
  "PersonalInfo": {
    "PersonalJob": "Fullstack developer",
    "PhotoAlt": "Personal Photo"
  },
  "ContactData": {
    "Contact": "Contact",
    "Email": "Email: ",
    "Phone": "Phone: ",
    "Social": "Social media"
  },
  "Experience": {
    "Title": "Work experience",
    "1": {
      "Job": "Fullstack Developer",
      "Company": "Burst your ideas",
      "Dates": "2024 - Present",
      "Description": "I work on Fronted with technologies such as \nReact, Next, Javascript, HTML, CSS, Tailwind and Typescript \nBackend with tecnnologies like Ruby on Rails and PostgreSQL\n I create different web pages, fixing errors, creating reusable components and creation and use of different APIs, both internals and third parties\nWe use Git as a version control tool, Slack and Trello to organize our work",
      "Link": "https://burstyourideas.com/"
    }
  },
  "Technologies": {
    "Title": "Technologies",
    "Front": "Frontend",
    "Back": "Backend",
    "Other": "Other technologies",
    "Next": {
      "Description1": "Since 2024, I've been actively working with Next.js, developing modern and scalable web applications. During this time, I've created numerous custom components and integrated components from external libraries to optimize the user experience and improve development productivity",
      "Description2": "I've worked on projects built with both JavaScript and TypeScript, which has allowed me to easily adapt to different technical environments and requirements. I've also used TailwindCSS in several of these projects to implement clean, responsive, and highly customizable interfaces, although I've also worked without this framework, applying more traditional CSS solutions according to the project's needs",
      "Description3": "My experience ranges from creating dynamic interfaces to optimizing performance by using key Next.js features such as dynamic routes, server-side rendering (SSR), static generation (SSG), and handling API routes, as well as integrating them with external databases and services"
    },
    "React": {
      "Description1": "In 2024, I started working on user interface and single-page application (SPA) development using React, focusing on creating interactive, component-oriented applications. During this time, I have designed and developed custom components, as well as integrated components and hooks from external libraries, which has allowed me to build modular, reusable, and maintainable solutions",
      "Description2": "Part of my experience includes the implementation and integration of Material UI (MUI) components, adapting their styles and behaviors to align with the visual and functional requirements of each project. I have also worked on the integration of specific features such as Google reCAPTCHA, ensuring form protection and secure user validation in real-world production environments",
      "Description3": "My work with React has focused on a practical and efficient approach to the component lifecycle, state management (both local and global), and continuous improvement of the user experience through fluid interactions, best practices, and optimized performance"
    },
    "Javascript": {
      "Description1": "I started working with JavaScript in 2022 developing small personal projects, and since 2023 I have participated in larger projects where I have been able to delve deeper into the language and apply its most advanced features in a practical way",
      "Description2": "Throughout this time, I've used events, promises, asynchronous functions, and classes (following object-oriented programming principles) to build dynamic functionalities tailored to the needs of each project. I've worked both on the frontend, manipulating the DOM and managing user interaction, and on the more structured logic of web applications",
      "Description3": "My approach to JavaScript has always been to write clean, reusable, and well-structured code, seeking a balance between readability and efficiency. This solid foundation in JavaScript has been fundamental to my subsequent work with frameworks like React and Next.js"
    },
    "HTML": {
      "Description1": "Since 2022, I've been working with HTML as a fundamental foundation for building semantic and accessible web page structures. I've applied best practices in content organization, the use of semantic tags, and SEO optimization, while maintaining a focus on markup clarity and accessibility",
      "Description2": "Throughout various projects, I've used HTML both in its most standard form and in combination with modern frameworks and libraries such as Bootstrap and TailwindCSS, adapting to different front-end architectures based on technical and design requirements. This experience has allowed me to create coherent, maintainable, and well-integrated structures with styles and behaviors defined in CSS or JavaScript/React components"
    },
    "CSS": {
      "Description1": "Since 2022 I have developed styles using CSS both in its traditional form and relying on frameworks such as Bootstrap and TailwindCSS, depending on the complexity and visual needs of each project",
      "Description2": "My experience includes creating responsive interfaces, using flexbox, grid, animations, pseudo-classes, and detailed design customization. I've worked on adapting styles to different devices and resolutions, as well as implementing reusable and scalable design systems",
      "Description3": "In addition to writing pure CSS, I've integrated styles into environments with modern tools like CSS Modules and Tailwind's utility-first approach, allowing me to maintain an efficient workflow consistent with modern design principles"
    },
    "Ruby": {
      "Description1": "My experience with Ruby has been developed mainly in the context of Ruby on Rails, a framework with which I have worked since 2024 in the construction of robust web applications, organized under the MVC (Model-View-Controller) pattern",
      "Description2": "I have developed and maintained functionalities both on the server side and in relational database management (especially with PostgreSQL), working with migrations, validations, associations between models and the creation of controllers and views that effectively respond to the needs of the frontend",
      "Description3": "I've also worked on route configuration, data serialization, and RESTful API development, facilitating integration with frontends developed in Next.js and React. My approach is based on writing clean code and following the framework's conventions, leveraging the productivity and clarity that Ruby and Rails offer for agile application development"
    },
    "PHP": {
      "Description1": "My experience with PHP began in 2023, developing server-side applications focused on dynamic web content generation and database interaction. During this time, I've gained experience writing efficient and structured scripts, applying good object-oriented programming practices, and separating business logic from presentation",
      "Description2": "My most significant experience with PHP was developing my final vocational training project, in which I designed and implemented a complete web application using PHP as the backend and JavaScript as the frontend, communicating both sides via HTTP requests. This project included user management, CRUD operations, validations, and database integration using MySQL",
      "Description3": "Throughout the process, I worked with forms, sessions, error handling, and basic security, which allowed me to consolidate my knowledge of the language and gain a practical understanding of its application in real development environments"
    },
    "Java": {
      "Description1": "I started learning Java in 2021, gaining a solid foundation in the language's syntax, object-oriented programming, and the fundamentals of computational logic. However, it wasn't until 2023 that I began working on more comprehensive and structured projects, applying my knowledge in practical contexts and with defined objectives",
      "Description2": "I have developed object-oriented applications using classes, inheritance, encapsulation, interfaces, and complex control structures. I have also worked on file management, the use of collections, and exception handling, focusing on writing clean, modular, and maintainable code"
    },
    "PostgreSQL": {
      "Description1": "I have worked with PostgreSQL as a relational database management system in almost all projects developed with Ruby on Rails, taking advantage of its robustness, performance and compatibility with demanding production environments",
      "Description2": "My experience includes creating and managing migrations, defining relational schemas, using associations between models, implementing custom SQL queries, and optimizing data access from the model layer"
    },
    "MySQL": {
      "Description1": "I have used MySQL in projects developed with Java and PHP, mainly taking advantage of MySQL Workbench and PHPMyAdmin as a graphical environment for managing databases, schemas and queries",
      "Description2": "My experience ranges from relational table design and primary/foreign key management to complex SQL query execution and CRUD operations integrated into applications"
    },
    "Csharp": {
      "Description1": "My experience with C# was key in my training as a developer, since it was the language with which I learned the fundamentals of functional programming in 2022 and developed a deeper understanding of concepts such as variable scopes, execution flows and recursion, among others",
      "Description2": "During this period, I worked primarily on creating console applications, developing projects that allowed me to apply both functional logic and more complex algorithmic structures. Among my notable projects were an implementation of Conway's Game of Life and a functional version of the classic Minesweeper, in which I addressed topics such as matrix manipulation and execution flow control"
    },
    "Python": {
      "Description1": "Since 2023, I have a solid foundation in Python, acquired through courses, personal projects, and practical exercises focused on understanding its clear syntax and multi-paradigm approach. Although I don't consider it the language I have the greatest depth in, I feel comfortable working with data structures, functions, flow control, and Python modules",
      "Description2": "My experience includes algorithmic problem-solving, task automation, and exploring tools within the Python ecosystem. This foundation allows me to tackle functional scripts and easily understand third-party Python code when it's necessary to integrate it into a project or understand its logic"
    },
    "Git": {
      "Description1": "Since 2023, I have been working continuously with Git as my primary version control tool, both on personal and collaborative projects. During this time, I have gained extensive experience managing branches, creating pull requests, resolving conflicts, and maintaining a clean and understandable change history",
      "Description2": "Additionally, I have worked with platforms such as GitHub, taking advantage of its code review tools, issue tracking and task automation through GitHub Actions when necessary"
    }
  },
  "Projects": {
    "Title": "Projects",
    "1": {
      "Title": "Chess",
      "ShortDescription": "Classic chess game made for teaching, studying or just playing a game with someone at your side. Programmed from 0 using simply Javascript, HTML and CSS (logic from zero, no external libraries, except for Google Fonts)",
      "ProjectDescription1": "A chess game created from scratch with JavaScript, HTML, and CSS. For this project, I decided to manipulate the DOM using JavaScript as my primary strategy and use only HTML and CSS, as the goal was to demonstrate my knowledge of JavaScript and my programming logic.",
      "ProjectDescription2": "To achieve this, I have used functions, classes, objects, events and, of course, conditionals and loops, to achieve a fully functional chess game.",
      "ProjectDescription3": "Among its implemented functionalities, the following stand out:",
      "FunctionsList1": "Check",
      "FunctionsList2": "Checkmate",
      "FunctionsList3": "Stalemate",
      "FunctionsList4": "Forbid illegal movements",
      "FunctionsList5": "Castle",
      "FunctionsList6": "En passant",
      "ImageAlt": "Chess project image"
    },
    "2": {
      "Title": "Traveling-app",
      "ShortDescription": "Website that offers users different tourist destinations for their next holidays. Made in NextJS 15 and with dependencies on React 19, leaflet, next-intl, nodemailer and lqip, among others.",
      "ProjectDescription1": "Website built in Nextjs 15 and React 19 applying multiple functionalities offered by these frameworks, in addition to relying on some external libraries",
      "ProjectDescription2": "The project consists of multiple components (both client and server), hooks and APIs to improve the scalability of the project and the overall performance of the website",
      "ProjectDescription3": "It also uses a small middleware that redirects the user based on their language preferences and also prevents a user from making many requests to the server (trying to avoid potential problems due to server overload)",
      "ProjectDescription4": "Among the main dependencies of the project we have:",
      "DependencyList1": "Library used to display locations → leaflet",
      "DependencyList2": "Library used to optimize images → lqip-modern",
      "DependencyList3": "Library used to manage languages → next-intl",
      "DependencyList4": "Library used to contact email → nodemailer",
      "ImageAlt": "Traveling app project image"
    }
  },
  "Studies": {
    "Title": "Education",
    "1": {
      "Certificate": "High Vocational Trainee \n Web Applications Development",
      "Institution": "Ilerna FP",
      "Dates": "September 2022 - June 2024",
      "Link": "https://www.ilerna.es/"
    },
    "2": {
      "Certificate": "First Certificate in English \nB2 Level",
      "Institution": "Cambridge",
      "Dates": "July 2019",
      "Link": "https://www.cambridgeenglish.org/es/exams-and-tests/first/"
    },
    "3": {
      "Certificate": "Bachelor's Degree \n Chemical Engineering",
      "Institution": "University of Cádiz",
      "Dates": "September 2013 - June 2019",
      "Link": "https://www.uca.es/"
    }
  },
  "AboutPage": {
    "AboutMyself": {
      "Title": "Background",
      "Description": "Programming since 2021, I have developed several applications, both web and desktop, in different programming languages according to the needs of the moment",
      "Description2": "In 2022 I started the Higher Vocational Training in Web Application Development, finishing it in 2024, having expanded my knowledge of web development much further in the process and applying this knowledge to my work",
      "Description3": "When I finished the training cycle, the company where I did my internship decided to keep me because they were very happy with my work during the internship period and, honestly, I couldn't be more grateful for this opportunity",
      "Description4": "And so we come to today, where I am looking for new challenges to continue growing professionally"
    }
  },
  "NotFoundPage": {
    "Description": "404 | Page not found"
  }
}
