{
  "Navbar": {
    "Home": "Inicio",
    "About": "Quién soy",
    "Technologies": "Tecnologías",
    "Projects": "Proyectos",
    "DownloadCV": "Descargar CV"
  },
  "PersonalInfo": {
    "PersonalJob": "Desarrollador fullstack",
    "PhotoAlt": "Foto Personal"
  },
  "ContactData": {
    "Contact": "Contacto",
    "Email": "Email: ",
    "Phone": "Teléfono: ",
    "Social": "Redes sociales"
  },
  "Experience": {
    "Title": "Experiencia laboral",
    "1": {
      "Job": "Desarrollador fullstack",
      "Company": "Burst your ideas",
      "Dates": "2024 - Presente",
      "Description": "En el fronted trabajo con tecnologías como \nReact, Next, Javascript, HTML, CSS, Tailwind y Typescript \nEn el backend, con tecnologías como Ruby on Rails y PostgreSQL\n Me dedico a crear diferentes páginas webs, corregir errores, \ncrear componentes robustos, sólidos y reutilizables \ny a la creación y consumo de APIs, tanto internas como externas\nUtilizamos Git como herramienta de control de versiones, Slack y Trello para organizarnos el trabajo",
      "Link": "https://burstyourideas.com/"
    }
  },
  "Technologies": {
    "Title": "Tecnologías",
    "Front": "Frontend",
    "Back": "Backend",
    "Other": "Otras tecnologías",
    "Next": {
      "Description1": "Desde 2024 he trabajado activamente con Next.js desarrollando aplicaciones web modernas y escalables. A lo largo de este tiempo, he creado numerosos componentes personalizados y también he integrado componentes de librerías externas para optimizar la experiencia del usuario y mejorar la productividad del desarrollo",
      "Description2": "He trabajado en proyectos construidos tanto con JavaScript como con TypeScript, lo que me ha permitido adaptarme fácilmente a distintos entornos técnicos y requerimientos. Asimismo, he utilizado TailwindCSS en varios de estos proyectos para implementar interfaces limpias, responsivas y altamente personalizables, aunque también he trabajado sin este framework, aplicando soluciones CSS más tradicionales según las necesidades del proyecto",
      "Description3": "Mi experiencia abarca desde la creación de interfaces dinámicas hasta la optimización del rendimiento mediante el uso de características clave de Next.js como rutas dinámicas, renderizado del lado del servidor (SSR), generación estática (SSG) y el manejo de API routes, además de su integración con bases de datos y servicios externos"
    },
    "React": {
      "Description1": "En 2024 empecé a trabajar en el desarrollo de interfaces de usuario y de single page application (SPA) utilizando React, enfocándome en la creación de aplicaciones interactivas y orientadas a componentes. Durante este tiempo, he diseñado y desarrollado componentes personalizados, así como integrado componentes y hooks de librerías externas, lo que me ha permitido construir soluciones modulares, reutilizables y mantenibles",
      "Description2": "Parte de mi experiencia incluye la implementación e integración de componentes de Material UI (MUI), adaptando sus estilos y comportamientos para alinearlos con los requerimientos visuales y funcionales de cada proyecto. También he trabajado en la integración de funcionalidades específicas como Google reCAPTCHA, asegurando la protección de formularios y la validación segura de usuarios en entornos reales de producción",
      "Description3": "Mi trabajo con React se ha centrado en un enfoque práctico y eficiente del ciclo de vida de los componentes, el manejo del estado (tanto local como global) y la mejora continua de la experiencia del usuario a través de interacciones fluidas, buenas prácticas y un rendimiento optimizado"
    },
    "Javascript": {
      "Description1": "Comencé a trabajar con JavaScript en 2022 desarrollando pequeños proyectos personales, y desde 2023 he participado en proyectos de mayor envergadura donde he podido profundizar en el lenguaje y aplicar sus características más avanzadas de manera práctica",
      "Description2": "A lo largo de este tiempo he utilizado eventos, promesas, funciones asíncronas y clases (siguiendo principios de programación orientada a objetos) para construir funcionalidades dinámicas y adaptadas a las necesidades de cada proyecto. He trabajado tanto en el frontend, manipulando el DOM y gestionando la interacción del usuario, como en la lógica más estructurada de aplicaciones web",
      "Description3": "Mi enfoque con JavaScript ha sido siempre escribir código limpio, reutilizable y bien estructurado, buscando el equilibrio entre la legibilidad y la eficiencia. Esta base sólida en JavaScript ha sido fundamental para mi trabajo posterior con frameworks como React y Next.js"
    },
    "HTML": {
      "Description1": "Desde 2022 he trabajado con HTML como base fundamental en la construcción de estructuras semánticas y accesibles para páginas web. He aplicado buenas prácticas en la organización del contenido, el uso de etiquetas semánticas y la optimización para SEO, manteniendo un enfoque en la claridad del marcado y la accesibilidad",
      "Description2": "A lo largo de distintos proyectos, he utilizado HTML tanto en su forma más estándar, como en combinación con frameworks y librerías modernas como Bootstrap y TailwindCSS, adaptándome a distintas arquitecturas de frontend según los requerimientos técnicos y de diseño. Esta experiencia me ha permitido crear estructuras coherentes, mantenibles y bien integradas con los estilos y comportamientos definidos en CSS o en componentes de JavaScript/React"
    },
    "CSS": {
      "Description1": "Desde 2022 he desarrollado estilos utilizando CSS tanto en su forma tradicional como apoyándome en frameworks como Bootstrap y TailwindCSS, según la complejidad y necesidades visuales de cada proyecto",
      "Description2": "Mi experiencia incluye la creación de interfaces responsivas, el uso de flexbox, grid, animaciones, pseudo-clases y personalización detallada del diseño. He trabajado en la adaptación de estilos a distintos dispositivos y resoluciones, así como en la implementación de sistemas de diseño reutilizables y escalables",
      "Description3": "Además de escribir CSS puro, he integrado estilos en entornos con herramientas modernas como CSS Modules y el enfoque utility-first de Tailwind, permitiéndome mantener un flujo de trabajo eficiente y coherente con los principios del diseño moderno"
    },
    "Ruby": {
      "Description1": "Mi experiencia con Ruby se ha desarrollado principalmente en el contexto de Ruby on Rails, framework con el que he trabajado desde 2024 en la construcción de aplicaciones web robustas, organizadas bajo el patrón MVC (Modelo-Vista-Controlador)",
      "Description2": "He desarrollado y mantenido funcionalidades tanto del lado del servidor como en la gestión de bases de datos relacionales (especialmente con PostgreSQL), trabajando con migraciones, validaciones, asociaciones entre modelos y la creación de controladores y vistas que respondan de forma eficaz a las necesidades del frontend",
      "Description3": "También he trabajado en la configuración de rutas, la serialización de datos y la creación de API RESTful, facilitando la integración con frontends desarrollados en Next.js y React. Mi enfoque se basa en escribir código limpio y seguir las convenciones del framework, aprovechando la productividad y claridad que Ruby y Rails ofrecen para el desarrollo ágil de aplicaciones"
    },
    "PHP": {
      "Description1": "Mi experiencia con PHP se remonta a 2023, desarrollando aplicaciones del lado del servidor orientadas a la generación dinámica de contenido web y la interacción con bases de datos. Durante este tiempo, he adquirido experiencia en la escritura de scripts eficientes y estructurados, aplicando buenas prácticas de programación orientada a objetos y separando la lógica del negocio de la presentación",
      "Description2": "Mi experiencia más significativa con PHP fue el desarrollo de mi proyecto final de FP, en el que diseñé e implementé una aplicación web completa, utilizando PHP como backend y JavaScript como frontend y comunicando ambas partes mediante peticiones HTTP. Este proyecto incluyó la gestión de usuarios, operaciones CRUD, validaciones, y la integración con bases de datos mediante MySQL",
      "Description3": "A lo largo del proceso, trabajé con formularios, sesiones, control de errores y seguridad básica, lo que me permitió consolidar mis conocimientos del lenguaje y adquirir una visión práctica de su aplicación en entornos reales de desarrollo"
    },
    "Java": {
      "Description1": "Comencé a aprender Java en 2021, adquiriendo una base sólida en la sintaxis del lenguaje, la programación orientada a objetos y los fundamentos de la lógica computacional. Sin embargo, fue a partir de 2023 cuando empecé a trabajar en proyectos más completos y estructurados, aplicando mis conocimientos en contextos prácticos y con objetivos definidos",
      "Description2": "He desarrollado aplicaciones orientadas a objetos, utilizando clases, herencia, encapsulamiento, interfaces y estructuras de control complejas. Además, he trabajado en la gestión de archivos, el uso de colecciones y el manejo de excepciones, enfocándome en escribir código limpio, modular y mantenible"
    },
    "PostgreSQL": {
      "Description1": "He trabajado con PostgreSQL como sistema de gestión de bases de datos relacional en casi todos los proyectos desarrollados con Ruby on Rails, aprovechando su robustez, rendimiento y compatibilidad con entornos de producción exigentes",
      "Description2": "Mi experiencia incluye la creación y gestión de migraciones, definición de esquemas relacionales, uso de asociaciones entre modelos, implementación de consultas SQL personalizadas y optimización del acceso a los datos desde la capa del modelo"
    },
    "MySQL": {
      "Description1": "He utilizado MySQL en proyectos desarrollados con Java y PHP, aprovechando principalmente MySQL Workbench y PHPMyAdmin como entorno gráfico para la gestión de bases de datos, esquemas y consultas",
      "Description2": "Mi experiencia abarca desde el diseño de tablas relacionales y el manejo de claves primarias/foráneas, hasta la ejecución de consultas SQL complejas y operaciones CRUD integradas en las aplicaciones"
    },
    "Csharp": {
      "Description1": "Mi experiencia con C# fue clave en mi formación como desarrollador, ya que fue el lenguaje con el que aprendí en 2022 los fundamentos de la programación funcional y desarrollé una comprensión más profunda de conceptos como ámbitos de las variables, flujos de ejecución y recursividad, entre otros",
      "Description2": "Durante esta etapa, trabajé principalmente en la creación de aplicaciones de consola, desarrollando proyectos que me permitieron aplicar tanto la lógica funcional como estructuras algorítmicas más complejas. Entre los proyectos que destaqué se encuentran una implementación del Juego de la Vida de Conway y una versión funcional del clásico Buscaminas, en los que abordé temas como la manipulación de matrices y control del flujo de ejecución"
    },
    "Python": {
      "Description1": "Desde 2023 cuento con una base sólida en Python, adquirida a través de cursos, proyectos personales y ejercicios prácticos enfocados en la comprensión de su sintaxis clara y su enfoque multiparadigma. Aunque considero que no es el lenguaje en el que tengo mayor profundidad, me siento cómodo trabajando con estructuras de datos, funciones, control de flujo y módulos propios de Python",
      "Description2": "Mi experiencia incluye la resolución de problemas algorítmicos, automatización de tareas y la exploración de herramientas del ecosistema Python. Esta base me permite abordar scripts funcionales y comprender con facilidad código Python de terceros cuando es necesario integrarlo en un proyecto o entender su lógica"
    },
    "Git": {
      "Description1": "Desde 2023 he trabajado de forma continua con Git como herramienta principal de control de versiones, tanto en proyectos personales como colaborativos. Durante este tiempo, he adquirido una buena práctica en la gestión de ramas, la creación de pull requests, la resolución de conflictos y el mantenimiento de un historial de cambios limpio y comprensible",
      "Description2": "Además, he trabajado con plataformas como GitHub, aprovechando sus herramientas de revisión de código, seguimiento de issues y automatización de tareas mediante GitHub Actions cuando ha sido necesario"
    }
  },
  "Projects": {
    "Title": "Proyectos",
    "1": {
      "Title": "Ajedrez",
      "ShortDescription": "Clásico juego de ajedrez perfecto para enseñar, estudiar o sencillamente jugar con alguien a tu lado. Programado desde 0 usando simplemente Javascript, HTML y CSS (lógica desde cero, sin librerías externas, excepto la de Google Fonts)",
      "ProjectDescription1": "Ajedrez creado desde cero con Javascript, HTML y CSS. Para este proyecto decidí manipular el DOM desde Javascript como estrategia principal y apenas usar el HTML y CSS, dado que el objetivo era demostrar mis conocimientos de Javascript y mi lógica de programación",
      "ProjectDescription2": "Para ello, he hecho uso de funciones, clases, objetos, eventos y, por supuesto, condicionales y bucles, para conseguir un ajedrez completamente funcional",
      "ProjectDescription3": "Entre sus funcionalidades implementadas, caben destacar:",
      "FunctionsList1": "Jaque",
      "FunctionsList2": "Jaque Mate",
      "FunctionsList3": "Ahogado",
      "FunctionsList4": "Impedir movimientos ilegales",
      "FunctionsList5": "Enroque",
      "FunctionsList6": "Captura al paso",
      "ImageAlt": "Imagen proyecto ajedrez"
    },
    "2": {
      "Title": "Traveling-app",
      "ShortDescription": "Web que ofrece a los usuarios diferentes destinos turísticos para su próxima escapada. Hecha en NextJS 15 y con dependencias de React 19, leaflet, next-intl, nodemailer y lqip, entre otras",
      "ProjectDescription1": "Página web construida en Nextjs 15 y React 19 aplicando múltiples funcionalidades que ofrecen dichos frameworks, además de apoyarme en algunas librerías externas",
      "ProjectDescription2": "El proyecto consta de múltiples componentes (tanto de cliente como de servidor), hooks y APIs para mejorar la escalabilidad del proyecto y el rendimiento general de la web",
      "ProjectDescription3": "También utiliza un pequeño middleware que redirige al usuario en función de sus preferencias de idioma y que, también, evita que un usuario pueda realizar muchas peticiones al servidor (intentando paliar así potenciales problemas por sobrecarga del mismo)",
      "ProjectDescription4": "Entre las principales dependencias del proyecto tenemos:",
      "DependencyList1": "Librería utilizada para mostrar las ubicaciones → leaflet",
      "DependencyList2": "Librería utilizada para la optimización de imágenes → lqip-modern",
      "DependencyList3": "Librería utilizada para gestionar los idiomas → next-intl",
      "DependencyList4": "Librería utilizada para contactar al correo electrónico → nodemailer",
      "ImageAlt": "Imagen proyecto traveling app"
    }
  },
  "Studies": {
    "Title": "Formación",
    "1": {
      "Certificate": "FP Superior DAW \n Desarrollo Aplicaciones Web",
      "Institution": "Ilerna FP",
      "Dates": "Septiembre 2022 - Junio 2024",
      "Link": "https://www.ilerna.es/"
    },
    "2": {
      "Certificate": "First Certificate in English \nB2 Level",
      "Institution": "Cambridge",
      "Dates": "Julio 2019",
      "Link": "https://www.cambridgeenglish.org/es/exams-and-tests/first/"
    },
    "3": {
      "Certificate": "Grado Ingeniería Química",
      "Institution": "Universidad de Cádiz",
      "Dates": "Septiembre 2013 - Junio 2019",
      "Link": "https://www.uca.es/"
    }
  },
  "AboutPage": {
    "AboutMyself": {
      "Title": "Conóceme mejor",
      "Description": "Programando desde 2021, he desarrollado varias aplicaciones, tanto web como de escritorio, en diferentes lenguajes de programación según la necesidad del momento",
      "Description2": "En 2022 empecé el FP Superior de Desarrollo de Aplicaciones Web, terminándolo en 2024 habiendo expandido en el proceso mucho más mis conocimientos sobre el desarrollo web y aplicando dichos conocimientos a mi trabajo",
      "Description3": "Cuando terminé el ciclo formativo, la empresa donde realicé mis prácticas decidió retenerme dado que estuvieron muy contentos con mi labor desempeñada durante el periodo de prácticas y, la verdad, es que no les puedo estar más agradecido por dicha oportunidad",
      "Description4": "Y así llegamos al día de hoy, donde estoy buscando nuevos retos para poder seguir creciendo profesionalmente"
    }
  },
  "NotFoundPage": {
    "Description": "404 | Página no encontrada"
  },
  "Metadata": {
    "title": "Porfolio de Juan Jose Saborido Barranco",
    "description": "Bienvenido al porfolio de un desarrollador fullstack."
  }
}
